grevaillot/svd_tools/headers/STM32H7x7_CM4/gpioa.h
#define GPIOA_GPIO_PUPDR_PUPD15_SHIFT		30
#define GPIOA_GPIO_PUPDR_PUPD15_MASK		0x03
/** @defgroup gpioa_gpio_pupdr_pupd15 PUPD15 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOA_GPIO_PUPDR_PUPD14_SHIFT		28
#define GPIOA_GPIO_PUPDR_PUPD14_MASK		0x03
/** @defgroup gpioa_gpio_pupdr_pupd14 PUPD14 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOA_GPIO_PUPDR_PUPD13_SHIFT		26
#define GPIOA_GPIO_PUPDR_PUPD13_MASK		0x03
/** @defgroup gpioa_gpio_pupdr_pupd13 PUPD13 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOA_GPIO_PUPDR_PUPD12_SHIFT		24
#define GPIOA_GPIO_PUPDR_PUPD12_MASK		0x03
/** @defgroup gpioa_gpio_pupdr_pupd12 PUPD12 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOA_GPIO_PUPDR_PUPD11_SHIFT		22
#define GPIOA_GPIO_PUPDR_PUPD11_MASK		0x03
/** @defgroup gpioa_gpio_pupdr_pupd11 PUPD11 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOA_GPIO_PUPDR_PUPD10_SHIFT		20
#define GPIOA_GPIO_PUPDR_PUPD10_MASK		0x03
/** @defgroup gpioa_gpio_pupdr_pupd10 PUPD10 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOA_GPIO_PUPDR_PUPD9_SHIFT		18
#define GPIOA_GPIO_PUPDR_PUPD9_MASK		0x03
/** @defgroup gpioa_gpio_pupdr_pupd9 PUPD9 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOA_GPIO_PUPDR_PUPD8_SHIFT		16
#define GPIOA_GPIO_PUPDR_PUPD8_MASK		0x03
/** @defgroup gpioa_gpio_pupdr_pupd8 PUPD8 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOA_GPIO_PUPDR_PUPD7_SHIFT		14
#define GPIOA_GPIO_PUPDR_PUPD7_MASK		0x03
/** @defgroup gpioa_gpio_pupdr_pupd7 PUPD7 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOA_GPIO_PUPDR_PUPD6_SHIFT		12
#define GPIOA_GPIO_PUPDR_PUPD6_MASK		0x03
/** @defgroup gpioa_gpio_pupdr_pupd6 PUPD6 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOA_GPIO_PUPDR_PUPD5_SHIFT		10
#define GPIOA_GPIO_PUPDR_PUPD5_MASK		0x03
/** @defgroup gpioa_gpio_pupdr_pupd5 PUPD5 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOA_GPIO_PUPDR_PUPD4_SHIFT		8
#define GPIOA_GPIO_PUPDR_PUPD4_MASK		0x03
/** @defgroup gpioa_gpio_pupdr_pupd4 PUPD4 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOA_GPIO_PUPDR_PUPD3_SHIFT		6
#define GPIOA_GPIO_PUPDR_PUPD3_MASK		0x03
/** @defgroup gpioa_gpio_pupdr_pupd3 PUPD3 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOA_GPIO_PUPDR_PUPD2_SHIFT		4
#define GPIOA_GPIO_PUPDR_PUPD2_MASK		0x03
/** @defgroup gpioa_gpio_pupdr_pupd2 PUPD2 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOA_GPIO_PUPDR_PUPD1_SHIFT		2
#define GPIOA_GPIO_PUPDR_PUPD1_MASK		0x03
/** @defgroup gpioa_gpio_pupdr_pupd1 PUPD1 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOA_GPIO_PUPDR_PUPD0_SHIFT		0
#define GPIOA_GPIO_PUPDR_PUPD0_MASK		0x03
/** @defgroup gpioa_gpio_pupdr_pupd0 PUPD0 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


/**@}*/

/** @defgroup gpioa_gpio_idr GPIOIDR GPIO port input data register
@{*/

/** GPIOA_GPIO_IDR_ID15 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOA_GPIO_IDR_ID15		(1 << 15)
/** GPIOA_GPIO_IDR_ID14 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOA_GPIO_IDR_ID14		(1 << 14)
/** GPIOA_GPIO_IDR_ID13 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOA_GPIO_IDR_ID13		(1 << 13)
/** GPIOA_GPIO_IDR_ID12 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOA_GPIO_IDR_ID12		(1 << 12)
/** GPIOA_GPIO_IDR_ID11 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOA_GPIO_IDR_ID11		(1 << 11)
/** GPIOA_GPIO_IDR_ID10 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOA_GPIO_IDR_ID10		(1 << 10)
/** GPIOA_GPIO_IDR_ID9 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOA_GPIO_IDR_ID9		(1 << 9)
/** GPIOA_GPIO_IDR_ID8 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOA_GPIO_IDR_ID8		(1 << 8)
/** GPIOA_GPIO_IDR_ID7 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOA_GPIO_IDR_ID7		(1 << 7)
/** GPIOA_GPIO_IDR_ID6 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOA_GPIO_IDR_ID6		(1 << 6)
/** GPIOA_GPIO_IDR_ID5 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOA_GPIO_IDR_ID5		(1 << 5)
/** GPIOA_GPIO_IDR_ID4 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOA_GPIO_IDR_ID4		(1 << 4)
/** GPIOA_GPIO_IDR_ID3 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOA_GPIO_IDR_ID3		(1 << 3)
/** GPIOA_GPIO_IDR_ID2 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOA_GPIO_IDR_ID2		(1 << 2)
/** GPIOA_GPIO_IDR_ID1 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOA_GPIO_IDR_ID1		(1 << 1)
/** GPIOA_GPIO_IDR_ID0 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOA_GPIO_IDR_ID0		(1 << 0)

/**@}*/

/** @defgroup gpioa_gpio_odr GPIOODR GPIO port output data register
@{*/

/** GPIOA_GPIO_ODR_OD15 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOA_GPIO_ODR_OD15		(1 << 15)
/** GPIOA_GPIO_ODR_OD14 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOA_GPIO_ODR_OD14		(1 << 14)
/** GPIOA_GPIO_ODR_OD13 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOA_GPIO_ODR_OD13		(1 << 13)
/** GPIOA_GPIO_ODR_OD12 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOA_GPIO_ODR_OD12		(1 << 12)
/** GPIOA_GPIO_ODR_OD11 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOA_GPIO_ODR_OD11		(1 << 11)
/** GPIOA_GPIO_ODR_OD10 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOA_GPIO_ODR_OD10		(1 << 10)
/** GPIOA_GPIO_ODR_OD9 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOA_GPIO_ODR_OD9		(1 << 9)
/** GPIOA_GPIO_ODR_OD8 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOA_GPIO_ODR_OD8		(1 << 8)
/** GPIOA_GPIO_ODR_OD7 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOA_GPIO_ODR_OD7		(1 << 7)
/** GPIOA_GPIO_ODR_OD6 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOA_GPIO_ODR_OD6		(1 << 6)
/** GPIOA_GPIO_ODR_OD5 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOA_GPIO_ODR_OD5		(1 << 5)
/** GPIOA_GPIO_ODR_OD4 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOA_GPIO_ODR_OD4		(1 << 4)
/** GPIOA_GPIO_ODR_OD3 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOA_GPIO_ODR_OD3		(1 << 3)
/** GPIOA_GPIO_ODR_OD2 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOA_GPIO_ODR_OD2		(1 << 2)
/** GPIOA_GPIO_ODR_OD1 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOA_GPIO_ODR_OD1		(1 << 1)
/** GPIOA_GPIO_ODR_OD0 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOA_GPIO_ODR_OD0		(1 << 0)

/**@}*/

/** @defgroup gpioa_gpio_bsrr GPIOBSRR GPIO port bit set/reset register
@{*/

